RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2.c
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2026-04-21     wdfk-prog    add stm32 adc v2 driver implementation
 */

/**
 * @file drv_adc_v2.c
 * @brief STM32 ADC V2 driver implementation.
 */
#include <rtconfig.h>

#if defined(RT_USING_ADC_V2)

#include "drv_config.h"
#include "drv_adc_v2_private.h"

#if defined(BSP_USING_ADC1) || defined(BSP_USING_ADC2) || defined(BSP_USING_ADC3) || defined(BSP_USING_ADC4)

#define DRV_DEBUG
#define LOG_TAG "drv.adc"
#include <drv_log.h>

/**
 * @brief Apply the STM32 private oversampling configuration to the ADC init structure.
 * @param adc Pointer to the STM32 ADC device object.
 * @return Operation status.
 */
static rt_err_t stm32_adc_apply_oversampling(struct stm32_adc *adc)
{
#if defined(STM32_ADC_HAS_HW_OVERSAMPLING)
    if (adc->config.oversampling_ratio == 0U)
    {
        adc->handle.Init.OversamplingMode = DISABLE;
        return RT_EOK;
    }

    adc->handle.Init.OversamplingMode = ENABLE;
    adc->handle.Init.Oversampling.Ratio = adc->config.oversampling_ratio;
    adc->handle.Init.Oversampling.RightBitShift = adc->config.oversampling_right_shift;
    adc->handle.Init.Oversampling.TriggeredMode = ADC_TRIGGEREDMODE_SINGLE_TRIGGER;
    adc->handle.Init.Oversampling.OversamplingStopReset = ADC_REGOVERSAMPLING_CONTINUED_MODE;
    return RT_EOK;
#else
    return (adc->config.oversampling_ratio == 0U) ? RT_EOK : -RT_ENOSYS;
#endif /* defined(STM32_ADC_HAS_HW_OVERSAMPLING) */
}

/**
 * @brief STM32 ADC object indexes.
 */
enum stm32_adc_index
{
#ifdef BSP_USING_ADC1
    ADC1_INDEX,
#endif /* BSP_USING_ADC1 */
#ifdef BSP_USING_ADC2
    ADC2_INDEX,
#endif /* BSP_USING_ADC2 */
#ifdef BSP_USING_ADC3
    ADC3_INDEX,
#endif /* BSP_USING_ADC3 */
#ifdef BSP_USING_ADC4
    ADC4_INDEX,
#endif /* BSP_USING_ADC4 */
};

/**
 * @brief STM32 ADC device table.
 */
static struct stm32_adc stm32_adc_obj[] = {
#ifdef BSP_USING_ADC1
    ADC1_V2_CONFIG,
#endif /* BSP_USING_ADC1 */
#ifdef BSP_USING_ADC2
    ADC2_V2_CONFIG,
#endif /* BSP_USING_ADC2 */
#ifdef BSP_USING_ADC3
    ADC3_V2_CONFIG,
#endif /* BSP_USING_ADC3 */
#ifdef BSP_USING_ADC4
    ADC4_V2_CONFIG,
#endif /* BSP_USING_ADC4 */
};

/**
 * @brief ADC hardware channel mapping table.
 */
static const uint32_t stm32_adc_channel_table[STM32_ADC_MAX_CHANNELS] = {
    ADC_CHANNEL_0,
    ADC_CHANNEL_1,
    ADC_CHANNEL_2,
    ADC_CHANNEL_3,
    ADC_CHANNEL_4,
    ADC_CHANNEL_5,
    ADC_CHANNEL_6,
    ADC_CHANNEL_7,
    ADC_CHANNEL_8,
    ADC_CHANNEL_9,
    ADC_CHANNEL_10,
    ADC_CHANNEL_11,
    ADC_CHANNEL_12,
    ADC_CHANNEL_13,
    ADC_CHANNEL_14,
    ADC_CHANNEL_15,
#if STM32_ADC_MAX_CHANNELS > 16
    STM32_ADC_CHANNEL_16,
#endif /* STM32_ADC_MAX_CHANNELS > 16 */
#if STM32_ADC_MAX_CHANNELS > 17
    STM32_ADC_CHANNEL_17,
#endif /* STM32_ADC_MAX_CHANNELS > 17 */
#if STM32_ADC_MAX_CHANNELS > 18
    STM32_ADC_CHANNEL_18,
#endif /* STM32_ADC_MAX_CHANNELS > 18 */
#if STM32_ADC_MAX_CHANNELS > 19
    STM32_ADC_CHANNEL_19,
#endif /* STM32_ADC_MAX_CHANNELS > 19 */
#if STM32_ADC_MAX_CHANNELS > 20
    STM32_ADC_CHANNEL_20,
#endif /* STM32_ADC_MAX_CHANNELS > 20 */
#if STM32_ADC_MAX_CHANNELS > 21
    STM32_ADC_CHANNEL_21,
#endif /* STM32_ADC_MAX_CHANNELS > 21 */
#if STM32_ADC_MAX_CHANNELS > 22
    STM32_ADC_CHANNEL_22,
#endif /* STM32_ADC_MAX_CHANNELS > 22 */
#if STM32_ADC_MAX_CHANNELS > 23
    STM32_ADC_CHANNEL_23,
#endif /* STM32_ADC_MAX_CHANNELS > 23 */
#if STM32_ADC_MAX_CHANNELS > 24
    STM32_ADC_CHANNEL_24,
#endif /* STM32_ADC_MAX_CHANNELS > 24 */
#if STM32_ADC_MAX_CHANNELS > 25
    STM32_ADC_CHANNEL_25,
#endif /* STM32_ADC_MAX_CHANNELS > 25 */
#if STM32_ADC_MAX_CHANNELS > 26
    STM32_ADC_CHANNEL_26,
#endif /* STM32_ADC_MAX_CHANNELS > 26 */
#if STM32_ADC_MAX_CHANNELS > 27
    STM32_ADC_CHANNEL_27,
#endif /* STM32_ADC_MAX_CHANNELS > 27 */
#if STM32_ADC_MAX_CHANNELS > 28
    STM32_ADC_CHANNEL_28,
#endif /* STM32_ADC_MAX_CHANNELS > 28 */
#if STM32_ADC_MAX_CHANNELS > 29
    STM32_ADC_CHANNEL_29,
#endif /* STM32_ADC_MAX_CHANNELS > 29 */
#if STM32_ADC_MAX_CHANNELS > 30
    STM32_ADC_CHANNEL_30,
#endif /* STM32_ADC_MAX_CHANNELS > 30 */
#if STM32_ADC_MAX_CHANNELS > 31
    STM32_ADC_CHANNEL_31,
#endif /* STM32_ADC_MAX_CHANNELS > 31 */
};

/**
 * @brief STM32 internal ADC channel capability entry.
 */
struct stm32_adc_internal_channel
{
    int logical_channel;                    /**< RT-Thread logical channel number, or negative if unsupported. */
    uint32_t hal_channel;                   /**< Primary HAL channel identifier. */
    rt_uint32_t instance_mask;              /**< ADC instances that can use the primary HAL channel. */
    uint32_t alternate_hal_channel;         /**< Alternate HAL channel identifier for instance-specific mappings. */
    rt_uint32_t alternate_instance_mask;    /**< ADC instances that can use the alternate HAL channel. */
};

/**
 * @brief STM32 internal ADC channel capability table.
 */
static const struct stm32_adc_internal_channel stm32_adc_internal_channels[] = {
    { STM32_ADC_TEMP_CHANNEL, STM32_ADC_TEMP_HAL_CHANNEL, STM32_ADC_TEMP_INSTANCE_MASK,
      STM32_ADC_TEMP_ALT_HAL_CHANNEL, STM32_ADC_TEMP_ALT_INSTANCE_MASK },
    { STM32_ADC_VBAT_CHANNEL, STM32_ADC_VBAT_HAL_CHANNEL, STM32_ADC_VBAT_INSTANCE_MASK,
      STM32_ADC_VBAT_ALT_HAL_CHANNEL, STM32_ADC_VBAT_ALT_INSTANCE_MASK },
    { STM32_ADC_VREF_CHANNEL, STM32_ADC_VREF_HAL_CHANNEL, STM32_ADC_VREF_INSTANCE_MASK,
      STM32_ADC_VREF_ALT_HAL_CHANNEL, STM32_ADC_VREF_ALT_INSTANCE_MASK },
};

/**
 * @brief Check whether an ADC channel is a valid HAL channel identifier.
 * @param hal_channel HAL channel identifier.
 * @return RT_TRUE if valid, otherwise RT_FALSE.
 */
static rt_bool_t stm32_adc_hal_channel_valid(uint32_t hal_channel)
{
    return (hal_channel != STM32_ADC_INVALID_CHANNEL) ? RT_TRUE : RT_FALSE;
}

/**
 * @brief Check whether an ADC peripheral instance matches an instance mask.
 * @param instance ADC peripheral instance.
 * @param mask STM32_ADC_INSTANCE_MASK_x bit mask.
 * @return RT_TRUE if the instance is included, otherwise RT_FALSE.
 */
rt_bool_t stm32_adc_instance_match(ADC_TypeDef *instance, rt_uint32_t mask)
{
#ifdef ADC1
    if ((instance == ADC1) && ((mask & STM32_ADC_INSTANCE_MASK_ADC1) != 0U))
    {
        return RT_TRUE;
    }
#endif /* ADC1 */

