RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2.c
    return RT_EOK;
}

/**
 * @brief Force one ADC device back to regular polling conversion mode.
 * @param adc Pointer to the STM32 ADC device object.
 *
 * Sequence reads use HAL_ADC_Start() and HAL_ADC_PollForConversion(), so any
 * DMA request state left by board initialization must be cleared before
 * starting a polling conversion.
 */
static void stm32_adc_force_poll_mode(struct stm32_adc *adc)
{
#if defined(ADC_CR2_DMA)
    CLEAR_BIT(adc->handle.Instance->CR2, ADC_CR2_DMA);
#endif /* defined(ADC_CR2_DMA) */

#if defined(ADC_CR2_DDS)
    CLEAR_BIT(adc->handle.Instance->CR2, ADC_CR2_DDS);
#endif /* defined(ADC_CR2_DDS) */

#if defined(STM32_ADC_HAS_INIT_DMA_CONT_REQUESTS)
    adc->handle.Init.DMAContinuousRequests = DISABLE;
#endif /* defined(STM32_ADC_HAS_INIT_DMA_CONT_REQUESTS) */

#if defined(STM32_ADC_HAS_INIT_CONVERSION_DATA_MANAGEMENT)
    adc->handle.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DR;
#endif /* defined(STM32_ADC_HAS_INIT_CONVERSION_DATA_MANAGEMENT) */
}

/**
 * @brief Open one STM32 ADC device.
 * @param device Pointer to the ADC device object.
 * @return Operation status.
 */
static rt_err_t stm32_adc_open(struct rt_adc_device *device)
{
    struct stm32_adc *adc;
    HAL_StatusTypeDef status;
    rt_err_t result;

    if (device == RT_NULL)
    {
        return -RT_EINVAL;
    }

    adc = (struct stm32_adc *)device->parent.user_data;
    if (adc == RT_NULL)
    {
        return -RT_EINVAL;
    }

    LOG_D("%s open start", adc->name);
    stm32_adc_enable_analog_support();
    result = stm32_adc_fill_init(adc);
    if (result != RT_EOK)
    {
        return result;
    }
    result = stm32_adc_apply_oversampling(adc);
    if (result != RT_EOK)
    {
        return result;
    }
    status = HAL_ADC_Init(&adc->handle);
    if (status != HAL_OK)
    {
        LOG_E("%s init failed", adc->name);
        return stm32_hal_status_to_rt_err(status);
    }
#if defined(STM32_ADC_HAS_CALIBRATION)
    result = stm32_adc_run_calibration(adc, &adc->config);
    if (result != RT_EOK)
    {
        return result;
    }
#endif /* defined(STM32_ADC_HAS_CALIBRATION) */
    LOG_I("%s opened", adc->name);
    return RT_EOK;
}

/**
 * @brief Close one STM32 ADC device.
 * @param device Pointer to the ADC device object.
 * @return Operation status.
 */
static rt_err_t stm32_adc_close(struct rt_adc_device *device)
{
    struct stm32_adc *adc;
    HAL_StatusTypeDef status;

    if (device == RT_NULL)
    {
        return -RT_EINVAL;
    }

    adc = (struct stm32_adc *)device->parent.user_data;
    if (adc == RT_NULL)
    {
        return -RT_EINVAL;
    }

    status = HAL_ADC_Stop(&adc->handle);
    if (status != HAL_OK)
    {
        LOG_W("%s stop during close failed", adc->name);
    }
    status = HAL_ADC_DeInit(&adc->handle);
    if (status != HAL_OK)
    {
        LOG_W("%s deinit during close failed", adc->name);
        return -RT_ERROR;
    }
    LOG_I("%s closed", adc->name);
    return RT_EOK;
}

#if defined(STM32_ADC_HAS_SINGLE_DIFF_FIELDS)
/**
 * @brief Get the HAL single-ended/differential selector from private configuration.
 * @param cfg Pointer to the STM32 backend private configuration.
 * @param single_diff Pointer to the output HAL single-ended or differential selector.
 * @return Operation status.
 */
static rt_err_t stm32_adc_get_single_diff(const struct stm32_adc_private_cfg *cfg, uint32_t *single_diff)
{
    *single_diff = ((cfg->input_modes & RT_ADC_INPUT_MODE_DIFFERENTIAL) != 0U) ?
                   STM32_ADC_DIFFERENTIAL_VALUE : STM32_ADC_SINGLE_ENDED_VALUE;
    return RT_EOK;
}
#endif /* defined(STM32_ADC_HAS_SINGLE_DIFF_FIELDS) */

/**
 * @brief Get one HAL sampling-time value from STM32 private configuration.
 * @param cfg Pointer to the STM32 backend private configuration.
 * @param sampling_time Pointer to the output HAL sampling-time value.
 * @return Operation status.
 */
static rt_err_t stm32_adc_get_sampling_time(const struct stm32_adc_private_cfg *cfg, uint32_t *sampling_time)
{
    if ((cfg == RT_NULL) || (sampling_time == RT_NULL))
    {
        return -RT_EINVAL;
    }

    *sampling_time = (cfg->sampling_time != 0U) ? cfg->sampling_time : ADC_DEFAULT_SAMPLING_TIME;
    return RT_EOK;
}

/**
 * @brief Configure one ADC regular rank.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channel RT-Thread ADC channel identifier.
 * @param rank Logical regular rank index.
 * @return Operation status.
 */
static rt_err_t stm32_adc_configure_rank(struct stm32_adc *adc, rt_uint8_t channel, rt_uint32_t rank)
{
    ADC_ChannelConfTypeDef config;
    HAL_StatusTypeDef status;
    uint32_t hal_channel;
    uint32_t hal_rank;
    uint32_t sampling_time;
    rt_err_t result;

    result = stm32_adc_get_channel_for_instance(adc, channel, &hal_channel);
    if (result != RT_EOK)
    {
        return result;
    }

    result = stm32_adc_get_rank_value(rank, &hal_rank);
    if (result != RT_EOK)
    {
        return result;
    }

    result = stm32_adc_get_sampling_time(&adc->config, &sampling_time);
    if (result != RT_EOK)
    {
        return result;
    }

    rt_memset(&config, 0, sizeof(config));
    config.Channel = hal_channel;
    config.Rank = hal_rank;
    config.SamplingTime = sampling_time;
#if defined(STM32_ADC_HAS_CONFIG_OFFSET)
    config.Offset = 0;
#endif /* defined(STM32_ADC_HAS_CONFIG_OFFSET) */
#if defined(STM32_ADC_HAS_CONFIG_OFFSET_NUMBER)
    config.OffsetNumber = ADC_OFFSET_NONE;
#endif /* defined(STM32_ADC_HAS_CONFIG_OFFSET_NUMBER) */
#if defined(STM32_ADC_HAS_SINGLE_DIFF_FIELDS)
    result = stm32_adc_get_single_diff(&adc->config, &config.SingleDiff);
    if ((result != RT_EOK) && (result != -RT_ENOSYS))
    {
        return result;
    }
#endif /* defined(STM32_ADC_HAS_SINGLE_DIFF_FIELDS) */

    status = HAL_ADC_ConfigChannel(&adc->handle, &config);
    if (status != HAL_OK)
    {
        LOG_E("%s configure rank failed", adc->name);
        return stm32_hal_status_to_rt_err(status);
    }

    return RT_EOK;
}

/**
 * @brief Clear backend ADC channel/rank configuration explicitly.
 * @param adc Pointer to the STM32 ADC device object.
 * @return Operation status.
 *
 * This operation is intentionally not called from normal session configuration.
 * It is an explicit escape hatch for users that need to clear stale
 * channel-number rank configuration before rebuilding a conversion session.
 */
static rt_err_t stm32_adc_clear_channel_config(struct stm32_adc *adc)
{
#if defined(STM32_ADC_HAS_CHANNEL_NUMBER_RANK) && defined(ADC_RANK_NONE)
    ADC_ChannelConfTypeDef config;
    HAL_StatusTypeDef status;
    rt_uint8_t channel;
    uint32_t hal_channel;
    uint32_t sampling_time;
    rt_err_t result;

