RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2.c
    return RT_EOK;

fail:
    LOG_E("%s sequence read failed: status=%d state=0x%08lx error=0x%08lx",
          adc->name, (int)status, (unsigned long)adc->handle.State, (unsigned long)adc->handle.ErrorCode);

    return stm32_hal_status_to_rt_err(status);
}

/**
 * @brief Stop one STM32 ADC sequence session.
 * @param device Pointer to the ADC device object.
 * @return Operation status.
 */
static rt_err_t stm32_adc_sequence_stop(struct rt_adc_device *device)
{
    struct stm32_adc *adc;
    HAL_StatusTypeDef status;
    rt_err_t result;

    adc = (struct stm32_adc *)device->parent.user_data;
    if (adc == RT_NULL)
    {
        return -RT_EINVAL;
    }

    LOG_D("%s sequence stop", adc->name);
    result = RT_EOK;

    status = HAL_ADC_Stop(&adc->handle);
    if (status != HAL_OK)
    {
        LOG_W("%s sequence stop failed", adc->name);
        return stm32_hal_status_to_rt_err(status);
    }

    return result;
}

#if defined(STM32_ADC_HAS_LL_VREF_CALC)
/**
 * @brief Calculate the ADC reference voltage from a raw VREF sample.
 * @param device Pointer to the ADC device object.
 * @param vref_mv Pointer to the input raw VREF code and output VDDA in mV.
 * @return Operation status.
 */
rt_err_t stm32_adc_calc_vref_mv(struct rt_adc_device *device, rt_uint32_t *vref_mv)
{
    struct stm32_adc *adc;
    rt_uint32_t raw_value;

    if (*vref_mv == 0U)
    {
        return -RT_EINVAL;
    }

    adc = (struct stm32_adc *)device->parent.user_data;
    if (adc == RT_NULL)
    {
        return -RT_EINVAL;
    }

    raw_value = *vref_mv;
    *vref_mv = (rt_uint32_t)STM32_ADC_CALC_VREF_MV(adc, raw_value);
    if (*vref_mv == 0U)
    {
        return -RT_EINVAL;
    }

    LOG_D("%s VREF calculated: raw=%lu vref=%lu mV", adc->name, (unsigned long)raw_value, (unsigned long)*vref_mv);
    return RT_EOK;
}
#endif /* defined(STM32_ADC_HAS_LL_VREF_CALC) */

/**
 * @brief Handle control commands on one STM32 ADC device.
 * @param device Pointer to the ADC device object.
 * @param cmd Control command.
 * @param args Pointer to the control argument buffer.
 * @return Operation status.
 */
static rt_err_t stm32_adc_control(struct rt_adc_device *device, int cmd, void *args)
{
    struct stm32_adc *adc;
    adc = (struct stm32_adc *)device->parent.user_data;
    if (adc == RT_NULL)
    {
        return -RT_EINVAL;
    }

    LOG_D("%s control cmd=%d", adc->name, cmd);
    switch (cmd)
    {
    case RT_ADC_CMD_GET_RESOLUTION:
        if (args == RT_NULL)
        {
            return -RT_EINVAL;
        }
        *((rt_uint8_t *)args) = stm32_adc_get_resolution_bits(adc);
        return RT_EOK;

    case RT_ADC_CMD_GET_VREF_CHANNEL:
        if (args == RT_NULL)
        {
            return -RT_EINVAL;
        }
        return stm32_adc_get_vref_logical_channel(adc, (rt_uint8_t *)args);

    case RT_ADC_CMD_CALC_VREF:
        if (args == RT_NULL)
        {
            return -RT_EINVAL;
        }
#if defined(STM32_ADC_HAS_LL_VREF_CALC)
        return stm32_adc_calc_vref_mv(device, (rt_uint32_t *)args);
#else
        if (device->default_vref_mv == 0U)
        {
            return -RT_ENOSYS;
        }
        *((rt_uint32_t *)args) = device->default_vref_mv;
        return RT_EOK;
#endif /* defined(STM32_ADC_HAS_LL_VREF_CALC) */

    case RT_ADC_CMD_CALIBRATE:
#if defined(STM32_ADC_HAS_CALIBRATION)
        return stm32_adc_run_calibration(adc, &adc->config);
#else
        return -RT_ENOSYS;
#endif /* defined(STM32_ADC_HAS_CALIBRATION) */

    case RT_ADC_CMD_SET_CONFIG:
        if (args == RT_NULL)
        {
            return -RT_EINVAL;
        }

        adc->config = *((const struct stm32_adc_private_cfg *)args);
        return RT_EOK;

    case RT_ADC_CMD_GET_CONFIG:
        if (args == RT_NULL)
        {
            return -RT_EINVAL;
        }
        *((struct stm32_adc_private_cfg *)args) = adc->config;
        return RT_EOK;

    case RT_ADC_CMD_CLEAR_CHANNEL_CONFIG:
        if (args != RT_NULL)
        {
            return -RT_EINVAL;
        }
        return stm32_adc_clear_channel_config(adc);

    default:
        RT_UNUSED(args);
        return -RT_ENOSYS;
    }
}

/**
 * @brief STM32 ADC core operation table.
 */
static const struct rt_adc_core_ops stm32_adc_core_ops = {
    .open = stm32_adc_open,
    .close = stm32_adc_close,
    .session_config = stm32_adc_session_config,
    .control = stm32_adc_control,
};

/**
 * @brief STM32 ADC sequence-session operation table.
 */
static const struct rt_adc_sequence_ops stm32_adc_sequence_ops = {
    .start = stm32_adc_sequence_start,
    .read = stm32_adc_sequence_read,
    .stop = stm32_adc_sequence_stop,
};

/**
 * @brief STM32 ADC operation table.
 */
static const struct rt_adc_ops stm32_adc_ops = {
    .core = &stm32_adc_core_ops,
    .sequence = &stm32_adc_sequence_ops,
};

/**
 * @brief Initialize and register STM32 ADC devices.
 * @return Operation status.
 */
int stm32_adc_init(void)
{
    rt_size_t index;
    int result;

    result = RT_EOK;
    for (index = 0; index < RT_ARRAY_SIZE(stm32_adc_obj); index++)
    {
        rt_atomic_store(&stm32_adc_obj[index].device.state, RT_ADC_STATE_IDLE);
        stm32_adc_obj[index].device.default_vref_mv = 0;
        if (rt_hw_adc_register(&stm32_adc_obj[index].device, stm32_adc_obj[index].name,
                               &stm32_adc_ops, &stm32_adc_obj[index]) != RT_EOK)
        {
            result = -RT_ERROR;
            continue;
        }
    }

    return result;
}
INIT_BOARD_EXPORT(stm32_adc_init);
#endif /* defined(BSP_USING_ADC1) || defined(BSP_USING_ADC2) || defined(BSP_USING_ADC3) || defined(BSP_USING_ADC4) */

#endif /* defined(RT_USING_ADC_V2) */
